"""text for tg_bot"""


class txt_reg:
    """
    A class representing text for use in bot scripts

    IMPORTANT: The text is mainly before registration.py and during registration.py

    Example of using a class:
    """
    welcome = 'Привет!'
    mistake = "Упс... Ошибочка вышла 🤷‍♂️"
    t_reg_name_1 = "Отлично, давай начнем"
    t_agreement_1 = "Ознакомьтесь с пользовательским соглашением."
    t_agreement_2 = "Можете ознакомиться с условиями соглашения ниже:"
    t_foolproof_buttons = "Используй, пожалуйста, предложенные кнопки!"
    fio = "Введите свое Имя"
    numb = "Введите свой номер телефона"
    mail = "Введите свою электронную почту"
